---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.IsShared
source: html/1bcfa7d3-abb7-1464-b7e3-b31d85baf731.htm
---
# Autodesk.Revit.DB.FamilyParameter.IsShared Property

Identifies if the parameter is a shared parameter.

## Syntax (C#)
```csharp
public bool IsShared { get; }
```